iamdario/DST5_Repository/BLE_Relay/STM32_WPAN/App/app_ble.c
        switch (meta_evt->subevent)
        {
          /* USER CODE BEGIN subevent */

          /* USER CODE END subevent */

          case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
            /* USER CODE BEGIN EVT_LE_CONN_COMPLETE */

            /* USER CODE END EVT_LE_CONN_COMPLETE */
            /**
             * The connection is done,
             */
            connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;
            BleApplicationContext.BleApplicationContext_legacy.connectionHandle = connection_complete_event->Connection_Handle;
            BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;

            /* CONNECTION WITH CLIENT */
            APP_DBG_MSG("\r\n\r**  CONNECTION COMPLETE EVENT WITH SERVER \n\r");
            //handleNotification.P2P_Evt_Opcode = PEER_CONN_HANDLE_EVT;
            //handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
            //P2PC_APP_Notification(&handleNotification);

            result = aci_gatt_disc_all_primary_services(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
            if (result == BLE_STATUS_SUCCESS)
            {
              APP_DBG_MSG("\r\n\r** GATT SERVICES & CHARACTERISTICS DISCOVERY  \n\r");
              APP_DBG_MSG("* GATT :  Start Searching Primary Services \r\n\r");
            }
            else
            {
              APP_DBG_MSG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
            }
            break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */

          case HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE:
            {
              uint8_t *adv_report_data;
              /* USER CODE BEGIN EVT_LE_ADVERTISING_REPORT */

              /* USER CODE END EVT_LE_ADVERTISING_REPORT */
              le_advertising_event = (hci_le_advertising_report_event_rp0 *) meta_evt->data;

              event_type = le_advertising_event->Advertising_Report[0].Event_Type;

              event_data_size = le_advertising_event->Advertising_Report[0].Length_Data;

              /* WARNING: be careful when decoding advertising report as its raw format cannot be mapped on a C structure.
              The data and RSSI values could not be directly decoded from the RAM using the data and RSSI field from hci_le_advertising_report_event_rp0 structure.
              Instead they must be read by using offsets (please refer to BLE specification).
              RSSI = (int8_t)*(uint8_t*) (adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data);
              */
              adv_report_data = (uint8_t*)(&le_advertising_event->Advertising_Report[0].Length_Data) + 1;
              k = 0;

              if (event_type == ADV_NONCONN_IND)
              {
            	  // Filter based on BLE MAC Address
            	  uint8_t MAC_Address[] = { BLE_MAC_DONGLE };

            	  if (MAC_Address[0] == le_advertising_event->Advertising_Report[0].Address[0] &&
					  MAC_Address[1] == le_advertising_event->Advertising_Report[0].Address[1] &&
					  MAC_Address[2] == le_advertising_event->Advertising_Report[0].Address[2] &&
					  MAC_Address[3] == le_advertising_event->Advertising_Report[0].Address[3] &&
					  MAC_Address[4] == le_advertising_event->Advertising_Report[0].Address[4] &&
					  MAC_Address[5] == le_advertising_event->Advertising_Report[0].Address[5])
            	  {
            		  if (BlueLedOn == 0)
					  {
						  BSP_LED_On(LED_BLUE);
						  BlueLedOn = 1;
					  }
					  else
					  {
						  BSP_LED_Off(LED_BLUE);
						  BlueLedOn = 0;
					  }

            		  //Convert Beacon Data into Respective Variables
            		  int16_t AccelR1_X = (((uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 21)) << 8) | (uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 20);
					  int16_t AccelR1_Y = (((uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 19)) << 8) | (uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 18);
					  int16_t AccelR1_Z = (((uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 17)) << 8) | (uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 16);

            		  int16_t AccelR2_X = (((uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 15)) << 8) | (uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 14);
					  int16_t AccelR2_Y = (((uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 13)) << 8) | (uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 12);
					  int16_t AccelR2_Z = (((uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 11)) << 8) | (uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 10);

            		  int16_t AccelR3_X = (((uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 9)) << 8) | (uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 8);
					  int16_t AccelR3_Y = (((uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 7)) << 8) | (uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 6);
					  int16_t AccelR3_Z = (((uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 5)) << 8) | (uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 4);

					  int16_t Accel_X[3] = {AccelR1_X, AccelR2_X, AccelR3_X};
					  int16_t Accel_Y[3] = {AccelR1_Y, AccelR2_Y, AccelR3_Y};
					  int16_t Accel_Z[3] = {AccelR1_Z, AccelR2_Z, AccelR3_Z};

					  uint16_t TempR = (((uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 3)) << 8) | (uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 2);

					  // Due to time limitations, we will only do simple processing of determining min and max values
					  for (int i = 0; i < 3; ++i)
					  {
						  if (AccelMax_X < Accel_X[i])
						  {
							  AccelMax_X = Accel_X[i];
						  }

						  if (AccelMax_Y < Accel_Y[i])
						  {
							  AccelMax_Y = Accel_Y[i];
						  }

