iamdario/DST5_Repository/BLE_Relay/STM32_WPAN/App/app_ble.c
						  if (AccelMax_Z < Accel_Z[i])
						  {
							  AccelMax_Z = Accel_Z[i];
						  }

						  if (AccelMin_X > Accel_X[i])
						  {
							  AccelMin_X = Accel_X[i];
						  }

						  if (AccelMin_Y > Accel_Y[i])
						  {
							  AccelMin_Y = Accel_Y[i];
						  }

						  if (AccelMin_Z > Accel_Z[i])
						  {
							  AccelMin_Z = Accel_Z[i];
						  }
					  }

					  if(TempMax < TempR)
					  {
						  TempMax = TempR;
					  }

					  if(TempMin > TempR)
					  {
						  TempMin = TempR;
					  }
					  UpdateBeaconData(UUID_0, (AccelAverage >> 8) & 0xFF);
					  UpdateBeaconData(UUID_1, (AccelAverage) & 0xFF);
					  UpdateBeaconData(UUID_2, (AccelMax_X >> 8) & 0xFF);
					  UpdateBeaconData(UUID_3, (AccelMax_X) & 0xFF);
					  UpdateBeaconData(UUID_4, (AccelMin_X >> 8) & 0xFF);
					  UpdateBeaconData(UUID_5, (AccelMin_X) & 0xFF);
					  UpdateBeaconData(UUID_6, (AccelMax_Y >> 8) & 0xFF);
					  UpdateBeaconData(UUID_7, (AccelMax_Y) & 0xFF);
					  UpdateBeaconData(UUID_8, (AccelMin_Y >> 8) & 0xFF);
					  UpdateBeaconData(UUID_9, (AccelMin_Y) & 0xFF);
					  UpdateBeaconData(UUID_10, (AccelMax_Z >> 8) & 0xFF);
					  UpdateBeaconData(UUID_11, (AccelMax_Z) & 0xFF);
					  UpdateBeaconData(UUID_12, (AccelMin_Z >> 8) & 0xFF);
					  UpdateBeaconData(UUID_13, (AccelMin_Z) & 0xFF);
					  UpdateBeaconData(UUID_14, (TempAverage >> 8) & 0xFF);
					  UpdateBeaconData(UUID_15, (TempAverage) & 0xFF);
					  UpdateBeaconData(MAJOR_0, (TempMax >> 8) & 0xFF);
					  UpdateBeaconData(MAJOR_1, (TempMax) & 0xFF);
					  UpdateBeaconData(MINOR_0, (TempMin >> 8) & 0xFF);
					  UpdateBeaconData(MINOR_1, (TempMin) & 0xFF);


//					  UpdateBeaconData(UUID_0, (uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 11));// Puts UUID_10 of received advertisement into UUID_0
//					  UpdateBeaconData(UUID_1, (uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 10));// Puts UUID_11 of received advertisement into UUID_1
//					  UpdateBeaconData(UUID_2, (uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 9)); // Puts UUID_12 of received advertisement into UUID_2
//					  UpdateBeaconData(UUID_3, (uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 8)); // Puts UUID_13 of received advertisement into UUID_3
//					  UpdateBeaconData(UUID_4, (uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 7)); // Puts UUID_14 of received advertisement into UUID_4
//					  UpdateBeaconData(UUID_5, (uint8_t)*(adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data - 6)); // Puts UUID_15 of received advertisement into UUID_5

					  // Transmit and Receive will no longer work without updating the beacon at this moment
#if TRANSMIT_AND_RECEIVE
					  IBeacon_Update();
#endif
            	  }

            	  // Filter based on received power
            	  int8_t RSSI = (int8_t)*(uint8_t*) (adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data);
            	  if (RSSI>=-80)
            	  {
//            		  // Swap LED State
//					  if (BlueLedOn == 0)
//					  {
//						  BSP_LED_On(LED_BLUE);
//						  BlueLedOn = 1;
//					  }
//					  else
//					  {
//						  BSP_LED_Off(LED_BLUE);
//						  BlueLedOn = 0;
//					  }

//					  UpdateBeaconData(UUID_10, le_advertising_event->Advertising_Report[0].Address[0]);
//					  UpdateBeaconData(UUID_11, le_advertising_event->Advertising_Report[0].Address[1]);
//					  UpdateBeaconData(UUID_12, le_advertising_event->Advertising_Report[0].Address[2]);
//					  UpdateBeaconData(UUID_13, le_advertising_event->Advertising_Report[0].Address[3]);
//					  UpdateBeaconData(UUID_14, le_advertising_event->Advertising_Report[0].Address[4]);
//					  UpdateBeaconData(UUID_15, le_advertising_event->Advertising_Report[0].Address[5]);

					  // Increment to indicate we have received another beacon
					  ++BeaconsReceived;
            	  }

        		  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_9, GPIO_PIN_SET); // A9 LED ON


//            	  if (BlueLedOn == 0)
//				  {
//            		  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_10, GPIO_PIN_SET); // A9 LED ON
//					  BlueLedOn = 1;
//				  }
//				  else
//				  {
//	            	  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_10, GPIO_PIN_SET); // A9 LED ON
//					  BlueLedOn = 0;
//				  }
              }

              /* search AD TYPE 0x09 (Complete Local Name) */
              /* search AD Type 0x02 (16 bits UUIDS) */
              if (event_type == ADV_IND)
              {
                /* ISOLATION OF BD ADDRESS AND LOCAL NAME */

                while(k < event_data_size)
                {
                  adlength = adv_report_data[k];
                  adtype = adv_report_data[k + 1];
                  switch (adtype)
                  {
                    case AD_TYPE_FLAGS: /* now get flags */
                      /* USER CODE BEGIN AD_TYPE_FLAGS */

                      /* USER CODE END AD_TYPE_FLAGS */
                      break;

                    case AD_TYPE_TX_POWER_LEVEL: /* Tx power level */
                      /* USER CODE BEGIN AD_TYPE_TX_POWER_LEVEL */

                      /* USER CODE END AD_TYPE_TX_POWER_LEVEL */
                      break;

                    case AD_TYPE_MANUFACTURER_SPECIFIC_DATA: /* Manufacturer Specific */
                      /* USER CODE BEGIN AD_TYPE_MANUFACTURER_SPECIFIC_DATA */

                      /* USER CODE END AD_TYPE_MANUFACTURER_SPECIFIC_DATA */
                      if (adlength >= 7 && adv_report_data[k + 2] == 0x01)
                      { /* ST VERSION ID 01 */
                        APP_DBG_MSG("--- ST MANUFACTURER ID --- \n\r");
                        switch (adv_report_data[k + 3])
                        {   /* Demo ID */
                           case CFG_DEV_ID_P2P_SERVER1: /* End Device 1 */
                           APP_DBG_MSG("-- SERVER DETECTED -- VIA MAN ID\n\r");
                           BleApplicationContext.DeviceServerFound = 0x01;
                           SERVER_REMOTE_ADDR_TYPE = le_advertising_event->Advertising_Report[0].Address_Type;
                           SERVER_REMOTE_BDADDR[0] = le_advertising_event->Advertising_Report[0].Address[0];
                           SERVER_REMOTE_BDADDR[1] = le_advertising_event->Advertising_Report[0].Address[1];
                           SERVER_REMOTE_BDADDR[2] = le_advertising_event->Advertising_Report[0].Address[2];
                           SERVER_REMOTE_BDADDR[3] = le_advertising_event->Advertising_Report[0].Address[3];
                           SERVER_REMOTE_BDADDR[4] = le_advertising_event->Advertising_Report[0].Address[4];
                           SERVER_REMOTE_BDADDR[5] = le_advertising_event->Advertising_Report[0].Address[5];
                           break;

                          default:
                            break;
                        }
                      }
                      break;

